


MULTIMOB Group                                                 H. Asaeda
Internet-Draft                                           Keio University
Intended status: Standards Track                                P. Seite
Expires: September 9, 2010                                France Telecom
                                                                  J. Xia
                                                                  Huawei
                                                           March 8, 2010


                    PMIPv6 Extensions for Multicast
                draft-asaeda-multimob-pmip6-extension-03

Abstract

   This document describes Proxy Mobile IPv6 (PMIPv6) extensions to
   support IP multicast.  The Mobile Access Gateway (MAG) and the Local
   Mobility Anchor (LMA) are the mobility entities defined in the PMIPv6
   protocol.  The proposed protocol extension provides; 1) a dedicated
   multicast tunnel (M-Tunnel) between LMA and MAG, and 2) local routing
   to deliver IP multicast packets for mobile nodes.  This document
   defines the roles of LMA and MAG to support IP multicast for the
   mobile nodes.

Status of this Memo

   This Internet-Draft is submitted to IETF in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on September 9, 2010.

Copyright Notice




Asaeda, et al.          Expires September 9, 2010               [Page 1]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


   Copyright (c) 2010 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the BSD License.

   This document may contain material from IETF Documents or IETF
   Contributions published or made publicly available before November
   10, 2008.  The person(s) controlling the copyright in some of this
   material may not have granted the IETF Trust the right to allow
   modifications of such material outside the IETF Standards Process.
   Without obtaining an adequate license from the person(s) controlling
   the copyright in such materials, this document may not be modified
   outside the IETF Standards Process, and derivative works of it may
   not be created outside the IETF Standards Process, except to format
   it for publication as an RFC or to translate it into languages other
   than English.



























Asaeda, et al.          Expires September 9, 2010               [Page 2]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  4
   2.  Conventions and Terminology  . . . . . . . . . . . . . . . . .  6
     2.1.  Conventions Used in This Document  . . . . . . . . . . . .  6
     2.2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . .  6
   3.  Overview . . . . . . . . . . . . . . . . . . . . . . . . . . .  7
     3.1.  Multicast Communication in PMIPv6  . . . . . . . . . . . .  7
     3.2.  Multicast Tunnel (M-Tunnel)  . . . . . . . . . . . . . . .  8
     3.3.  Protocol Sequence for Multicast Channel Subscription . . .  9
   4.  Local Mobility Anchor Operation  . . . . . . . . . . . . . . . 12
     4.1.  LMA Operating As PIM-SM Router . . . . . . . . . . . . . . 12
     4.2.  LMA Operating As MLD Proxy . . . . . . . . . . . . . . . . 12
   5.  Mobile Access Gateway Operation  . . . . . . . . . . . . . . . 13
     5.1.  MAG Operating As MLD Proxy . . . . . . . . . . . . . . . . 13
     5.2.  MAG Operating As PIM-SM Router . . . . . . . . . . . . . . 13
   6.  Mobile Node Operation  . . . . . . . . . . . . . . . . . . . . 15
   7.  Dual-Mode Implementation . . . . . . . . . . . . . . . . . . . 16
   8.  Handover Process . . . . . . . . . . . . . . . . . . . . . . . 17
     8.1.  MAG Operating As MLD Proxy . . . . . . . . . . . . . . . . 17
     8.2.  MAG Operating As Multicast Router  . . . . . . . . . . . . 20
     8.3.  Multicast Context Transfer Data Format . . . . . . . . . . 23
     8.4.  Proxy Binding Update with Multicast Extension  . . . . . . 24
   9.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 28
   10. Security Considerations  . . . . . . . . . . . . . . . . . . . 29
   11. Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 30
   12. References . . . . . . . . . . . . . . . . . . . . . . . . . . 31
     12.1. Normative References . . . . . . . . . . . . . . . . . . . 31
     12.2. Informative References . . . . . . . . . . . . . . . . . . 31
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 33





















Asaeda, et al.          Expires September 9, 2010               [Page 3]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


1.  Introduction

   Proxy Mobile IPv6 (PMIPv6) [2] enables network-based mobility for
   IPv6 mobile nodes (MNs) that do not implement any mobility protocols.
   The Local Mobility Anchor (LMA) is the topological anchor point to
   manages the mobile node's binding state.  The Mobile Access Gateway
   (MAG) is an access router or gateway that manages the mobility-
   related signaling for an MN.  An MN is attached to the Proxy Mobile
   IPv6 Domain (PMIPv6-Domain) that includes LMA and MAG(s), and is able
   to receive data coming from outside of the PMIPv6-Domain through LMA
   and MAG.

   Network-based mobility support for unicast is addressed in [2], while
   multicast support in PMIPv6 is not discussed in it.  LMA and MAG set
   up a bi-directional tunnel for each MN and forwards MN's traffic.  It
   is possible to deliver multicast packets destined to an MN over the
   subscriber's bi-directional tunnel.  However, it highly wastes
   network resources when a number of MNs join the same multicast
   sessions/channels, because independent data copies of each multicast
   packet is delivered in a unicast manner to MAG (as shown in
   Figure 1).  It also gives the overhead for the data encapsulation and
   decapsulation at LMA and MAG respectively to forward the same
   multicast packets.

                  MC1
                     \       =====MC1 for MN1======>
                      \-->   =====MC1 for MN2======>
                  MC2---->LMA===MC1,MC2 for MN3====>MAG
                             =====MC1 for MN4======>
                             =====MC2 for MN5======>
                                       :
                                       :

             MC: Multicast packets, ==>: Bi-directional tunnel

     Figure 1: Multicast channel subscription through subscriber's bi-
                            directional tunnel

   This document describes PMIPv6 extensions to support IP multicast
   communication for mobile nodes in PMIPv6-Domain.  The proposed
   protocol extension provides; 1) a dedicated multicast tunnel
   (M-Tunnel) between LMA and MAG, and 2) local routing to deliver IP
   multicast packets for mobile nodes.  In this document, multicast
   listener mobility is considered, while multicast source mobility is
   out of scope of this draft.

   This document assumes that LMA must be capable of forwarding
   multicast packets through MAG toward the corresponding mobile nodes.



Asaeda, et al.          Expires September 9, 2010               [Page 4]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


   This condition requires LMA to attach multicast networks by
   supporting multicast routing protocols such as Protocol-Independent
   Multicast - Sparse Mode (PIM-SM) [3] or other methods, and make
   traffic and QoS control if needed.  And MAG must maintain multicast
   membership status for the attached mobile nodes at the edge and
   forwards the multicast data from LMA to the member nodes.  This
   condition requires MAG to support MLD [4].  Each mobile node will
   connect MAG with a point-to-point access link.

   Seamless handover must also be considered.  When a mobile node
   receiving multicast data moves from an access link to another access
   link, the node continuously receives the multicast data through newly
   attached MAG.  The handover procedure should guarantee multicast
   session continuity and avoid extra packet loss and session
   disruption.  Context transfer will be the required function to
   support seamless handover, while its effective procedure should be
   taken into account interaction with multicast communication
   protocols.

   The PMIPv6 extension proposed in this document does not require to
   change unicast communication methods or protocols defined in [2], and
   therefore both unicast and multicast communications for mobile nodes
   in PMIPv6-Domain are enabled after all.




























Asaeda, et al.          Expires September 9, 2010               [Page 5]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


2.  Conventions and Terminology

2.1.  Conventions Used in This Document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL
   NOT","SHOULD", "SHOULD NOT", "RECOMMENDED","MAY", and "OPTIONAL" in
   this document are to be interpreted as described in RFC 2119 [1].

2.2.  Terminology

   The following terms used in this document are to be interpreted as
   defined in the Proxy Mobile IPv6 specification [2]; Mobile Access
   Gateway (MAG), Local Mobility Anchor (LMA), Mobile Node (MN), Proxy
   Mobile IPv6 Domain (PMIPv6-Domain), LMA Address (LMAA), Proxy Care-of
   Address (Proxy-CoA), Mobile Node's Home Network Prefix (MN-HNP),
   Mobile Node Identifier (MN-Identifier), Proxy Binding Update (PBU),
   and Proxy Binding Acknowledgement (PBA).

   As defined in [8], "upstream interface" or "host interface" is an MLD
   proxy device's interface in the direction of the root of the tree.
   Each of an MLD proxy device's interfaces that is not in the direction
   of the root of the tree is called "downstream interface" or "router
   interface".

   The Context Transfer Protocol (CXTP) specification [11] describes the
   mechanism that allows better support for minimizes service disruption
   during handover.  In this document, CXTP is adopted for the multicast
   context transfer protocol in PMIPv6, and "Multicast-Context Transfer
   Data (M-CTD)" is defined as the new terminology for transferring MLD
   state from previously attached MAG (p-MAG) to newly attached MAG
   (n-MAG).

   Mobile Node's Policy Profile includes "multicast channel
   information", whose contents are the same one M-CTD contains, and the
   mandatory fields of the policy profile specified in [2].  MN's Policy
   Profile is provided by "policy store" whose definition is the same as
   of [2], or by CXTP.














Asaeda, et al.          Expires September 9, 2010               [Page 6]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


3.  Overview

3.1.  Multicast Communication in PMIPv6

   Required components to enable IP multicast are multicast routing
   protocols and host-and-router communication protocols.  This document
   assumes PIM-SM [3] as the multicast routing protocol and MLDv2 [4] or
   LW-MLDv2 [5] as the host-and-router communication protocol.

   The architecture of a Proxy Mobile IPv6 domain is shown in Figure 2.
   LMA and MAG are the core functional entities in PMIPv6-Domain.  The
   entire PMIPv6-Domain appears as a single link from the perspective of
   each mobile node.

                       +---------+
                       | Content |
                       | Source  |
                       +---------+
                            |
                 ***  ***  ***  ***  ***
                *   **   **   **   **   *
               *                         *
                *     Fixed Internet    *
               *                         *
                *   **   **   **   **   *
                 ***  ***  ***  ***  ***
                     /            \
                  +----+        +----+
                  |LMA1|        |LMA2|
                  +----+        +----+
           LMAA1 -> |              | <-- LMAA2
                    |              |
                    \\            //\\
                     \\          //  \\
                      \\        //    \\
                       \\      //      \\
                        \\    //        \\
                         \\  //          \\
             Proxy-CoA1--> |              | <-- Proxy-CoA2
                        +----+          +----+
                        |MAG1|---{MN2}  |MAG2|
                        +----+  |       +----+
                          |     |         |
             MN-HNP1 -->  |   MN-HNP2     |  <-- MN-HNP3, MN-HNP4
                        {MN1}           {MN3}

                    Figure 2: Proxy Mobile IPv6 Domain




Asaeda, et al.          Expires September 9, 2010               [Page 7]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


   When a mobile node wants to subscribe/unsubscribe a multicast
   channel, the MN sends MLD Report messages with specifying sender and
   multicast addresses to the access link.  The attached MAG detects
   this membership information and transfers the information to the
   corresponding LMA over a multicast tunnel (M-Tunnel described in the
   next section) when needed, or transfers the information to the
   adjacent multicast router.

   When an LMA receives the membership information with MLD Report
   messages or with PIM Join/Prune messages, it coordinates the
   corresponding multicast routing tree if necessary.  This operation
   requires multicast routing protocols or proxy functions for LMA.

   When a MAG detects mobile node's handover, it can proceed the
   seamless handover procedures.  Since both PMIPv6 and multicast
   protocols (i.e., MLD and PIM-SM) do not have the functions for
   handover in the original protocol specifications, external functions
   or protocols such as CXTP [11] can be additionally used with PMIPv6
   Proxy Binding Update (PBU).

3.2.  Multicast Tunnel (M-Tunnel)

                   MC1
                      \
                       \-->
                   MC2---->LMA===MC1,MC2 for MNs====>MAG

                   MC: Multicast packets, ==>: M-Tunnel

         Figure 3: Multicast channel subscription through M-Tunnel

   M-Tunnel is a bi-directional tunnel dedicated for MLD message and IP
   multicast data transmissions between LMA and MAG.  It aggregates the
   same MLD and multicast packets and transmits different multicast
   channel data as shown in Figure 3.

   The format of the tunneled multicast packet forwarded from LMA is
   shown below.  "S" and "G" are the same notation used for (S,G)
   multicast channel.

        IPv6 header (src= LMAA, dst= Proxy-CoA) /* Tunnel Header */
           IPv6 header (src= S, dst= G)         /* Packet Header */
              Upper layer protocols             /* Packet Content*/

            Figure 4: Tunneled multicast packet from LMA to MAG

   When an MLD message is sent from MAG to LMA, the src and dst
   addresses of tunnel header will be replaced to Proxy-CoA and LMAA,



Asaeda, et al.          Expires September 9, 2010               [Page 8]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


   respectively.  To convey an MLD message, the src address of the
   packet header is changed to either LMA's or MAG's link-local address
   and the dst address of the packet header is assigned based on the
   MLD's condition.  (See Section 5.1.15 and 5.2.14 of [4].)

   M-Tunnel may be created dynamically when needed and removed when not
   needed, or implementations MAY choose to use static pre-established
   M-Tunnel instead of dynamically creating and tearing it down on a
   need basis.  The manner of M-Tunnel creation is similar to the manner
   of a subscriber's bi-directional tunnel creation as described in
   Section 5.6.1 of [2].  However, M-Tunnel is not per MN basis, but per
   MAG basis.  The M-Tunnel is shared with all MNs attached to the MAG.

3.3.  Protocol Sequence for Multicast Channel Subscription

   Upon multicast data reception, a mobile node sends MLD Report
   messages including source and multicast addresses.  Although MLDv2
   specification [4] permits to use the unspecified address (::) for a
   host whose interface has not acquired a valid link-local address yet,
   MLDv2 Report messages MUST be sent with a valid IPv6 link-local
   source address in PMIPv6 as defined in [9].  As well, MLDv2 Report
   messages MAY be sent with an IP destination address of FF02:0:0:0:0:
   0:0:16, to which all MLDv2-capable multicast routers listen, but the
   IP unicast address of the attached MAG SHALL be used in many cases as
   explained in [9].

   An MLD proxy [8] can simplify the implementation of multicast data
   forwarding.  By not supporting complicated multicast routing
   protocols, it reduces the implementation cost and the operational
   overhead.  Reducing the operational overhead will also contribute to
   faster routing convergence.  Another advantage is that an MLD proxy
   can be independent of the multicast routing protocol used by the core
   network routers.

   When a MAG operates as an MLD proxy and receives MLD Report messages
   from attached mobile nodes, it sends MLD messages on behalf of the
   mobile nodes.  MLD messages are always transferred over the M-Tunnel
   as seen in Figure 5.  MAG operating as an MLD proxy always registers
   "downstream interface (or router interface)" upon MLD message
   reception, but does not send MLD Report when the received source and
   multicast addresses have been already reported to the same LMA
   through the same "upstream interface (or host interface)".









Asaeda, et al.          Expires September 9, 2010               [Page 9]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


   MN1        MN2             MAG                 LMA
    |          |               |                   |
    |------MLD Report--------->|                   |
    |     (S1,G1) join         |     MLD Report    |
    |          |               |===== M-Tunnel ===>|
    |          |               |                   |---> PIM (S1,G1) join
    |          |               |                   |
    |          |--MLD Report-->|                   |
    |          | (S2,G2) join  |     MLD Report    |
    |          |               |===== M-Tunnel ===>|
    |          |               |                   |---> PIM (S2,G2) join
    |          |               |                   |
    |          |--MLD Report-->|                   |
    |          | (S1,G1) join  |                   |
    |          |               |                   |

                Figure 5: MLD Report Messages Transmission

   When a MAG operates as a PIM-SM router and receives MLD report
   messages from attached mobile nodes, it joins the multicast delivery
   tree by sending PIM join messages to its neighboring routers.  At the
   same time, the MAG sends MLD report messages with the Hold extension
   [9] with the corresponding multicast channel information to the LMA
   (Figure 6).  When receiving the MLD Hold, the LMA joins the multicast
   delivery tree but does not forward multicast data to the MAG.  The
   idea is to make the LMA ready to forward data.  When an MN changes
   the network, it will be able to continuously receive multicast data
   from the LMA, until a new MAG completes the handover routing update
   (detailed in Section 8).






















Asaeda, et al.          Expires September 9, 2010              [Page 10]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


   MN1        MN2             MAG                 LMA
    |          |               |                   |
    |------MLD Report--------->|                   |
    |     (S1,G1) join         |---> PIM (S1,G1) join
    |          |               |                   |
    |          |               |      MLD Hold     |
    |          |               |===== M-Tunnel ===>|
    |          |               |                   |---> PIM (S1,G1) join
    |          |               |                   | (No data forwarding)
    |          |--MLD Report-->|                   |
    |          | (S2,G2) join  |---> PIM (S2,G2) join
    |          |               |                   |
    |          |               |      MLD Hold     |
    |          |               |===== M-Tunnel ===>|
    |          |               |                   |---> PIM (S2,G2) join
    |          |               |                   | (No data forwarding)
    |          |--MLD Report-->|                   |
    |          | (S1,G1) join  |                   |
    |          |               |                   |

   Figure 6: MLD Report Messages Transmission when MAG acts as a router

   Whether a MAG works as an MLD proxy or a PIM-SM router, it MAY store
   multicast channel information reported by attached mobile nodes in
   the MN's policy profile (as defined in [2]).  This information may be
   used by the new MAG during the handover process (see Section 8).

























Asaeda, et al.          Expires September 9, 2010              [Page 11]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


4.  Local Mobility Anchor Operation

4.1.  LMA Operating As PIM-SM Router

   An LMA is responsible for maintaining the mobile node's reachability
   state and is the topological anchor point for the mobile node's home
   network prefix(es).  When an LMA acts as a PIM-SM [3] multicast
   router, it serves MAGs as listener nodes when the MAGs act as MLD
   proxies, or as downstream routers when the MAGs act as PIM-SM
   routers.  Each MAG is connected through an M-Tunnel for multicast
   communication.

   An LMA sets up the multicast state and joins the group.  Multicast
   packets are tunneled to a MAG that requested to receive the
   corresponding multicast session after being received by the LMA.  The
   MAG forwards these packets to the MN according to the multicast
   listener state in the MAG.

4.2.  LMA Operating As MLD Proxy

   An LMA may act as an MLD proxy [8].  When LMA acts as an MLD proxy,
   multicast data is forwarded from outside to mobile nodes through an
   M-Tunnel to MAG.

   When LMA acts as an MLD proxy, the attached MAGs must also act as an
   MLD proxy.

























Asaeda, et al.          Expires September 9, 2010              [Page 12]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


5.  Mobile Access Gateway Operation

   The mobile access gateway (MAG) is the entity that performs the
   mobility management on behalf of a mobile node.  MAG is responsible
   for detecting the mobile node's movements to and from the access
   link.

5.1.  MAG Operating As MLD Proxy

   [2] supports only point-to-point access link types for MAG and MN
   connection; hence an MN and a MAG are the only two nodes on an access
   link, where the link is assumed to be multicast capable.  Since a MAG
   will deal with mobile nodes' membership states reported by a large
   number of the downstream mobile nodes with MLD Report messages, the
   protocol scalability must be taken into account.

   A MAG acting as an MLD proxy sends MLD Query messages to all or some
   of attached mobile nodes.  After MAG receives MLD Report messages
   from the mobile nodes, it forwards the MLD Report messages on behalf
   of these mobile nodes to LMA.  Mobile nodes send MLD messages with
   their link-local address to MAG, and MAG forwards the MLD messages
   through the M-Tunnel to LMA with the MAG's link-local address.

   An MLD proxy requires that the upstream and downstream interfaces
   MUST be statistically configured.  As well, MAG MUST configure an
   upstream interface that is the interface MLD Report messages are sent
   to LMA and downstream interfaces that are the interfaces MLD Report
   messages are received from mobile nodes.  This upstream interface is
   the M-Tunnel end-point at the MAG.

5.2.  MAG Operating As PIM-SM Router

   The optimal multicast routing path does not always include LMA,
   especially in local routing as described in Section 6.10.3 of [2].
   The local routing option is designed to support node-to-node
   communication within PMIPv6-Domain where a local content source
   exists.

   To enable local routing, MAG MUST run multicast routing protocols to
   attach the optimal multicast routing path.  This document assume use
   of PIM-SM [3] as the supported multicast routing protocol.

   Because of its implementation or operational costs, operators may not
   want to support PIM-SM on MAG.  However, an MLD proxy requires to
   statically configure its upstream interface, which is an M-Tunnel as
   specified in Section 5.1, to receive all multicast data.  Therefore,
   if operators take into account the case that an upstream interface
   for the optimized multicast path is NOT an M-Tunnel to LMA but other



Asaeda, et al.          Expires September 9, 2010              [Page 13]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


   interface, and want MAG to "dynamically select" optimized routing
   path, MAG MUST act as a PIM-SM router.

















































Asaeda, et al.          Expires September 9, 2010              [Page 14]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


6.  Mobile Node Operation

   Mobile nodes attached to MAG can behave as the regular receiver
   hosts.  A mobile node sends MLD messages to MAG when it wants to
   subscribe and unsubscribe IP multicast channels.  And mobile nodes do
   not change their behaviors whether MAG is acting as an MLD proxy or a
   PIM-SM router.  All MLD related considerations are described in [9],
   which will give some advantage for its resource saving and seamless
   handover for PMIPv6 multicast.

   [2] allows a mobile node is a router.  However, to avoid the
   complexity, in this document, MN may behave as an MLD proxy [8] but
   should not act as a PIM-SM router, when MN needs to forward multicast
   data to its downstream nodes.





































Asaeda, et al.          Expires September 9, 2010              [Page 15]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


7.  Dual-Mode Implementation

   Operators may want to make LMA or MAG act as both an MLD proxy and a
   PIM-SM multicast router to support different customers.  This
   document proposes a "dual-mode" implementation that enables LMA or
   MAG to support both an MLD proxy function and a multicast routing
   function simultaneously.

   To simplify mobile node's handover procedure among dual-mode MAGs,
   p-MAG and n-MAG should not change the behaviors for the same mobile
   node.  For instance, in dual-mode, if p-MAG that a mobile node
   attaches is working as an MLD proxy, n-MAG that the mobile node will
   attach must also work as an MLD proxy.  It is same as of PIM-SM.






































Asaeda, et al.          Expires September 9, 2010              [Page 16]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


8.  Handover Process

   MAG is responsible for detecting the mobile node's movements to and
   from the access link and for initiating binding registrations to the
   mobile node's LMA.  MAG tracks the mobile node's movements to and
   from the access link and for signaling the mobile node's LMA.  In
   PMIPv6, it SHOULD NOT require for mobile nodes to initiate to re-
   subscribe multicast channels, and MAG SHOULD keep multicast channel
   subscription status for mobile nodes even if they attach a different
   MAG in PMIPv6-Domain.  In this section, mobility handover procedures
   are described.

8.1.  MAG Operating As MLD Proxy

   When MAG operates as an MLD proxy, there are two possible ways to
   proceed MLD listener handover; MLD listener handover with CXTP and
   MLD listener handover with MN's Policy Profile.  A Proxy Binding
   Update with multicast extension (PBU-M) (defined in Section 8.4) is
   always used to request the LMA to forward multicast data.

   The MLD listener handover with CXTP shown in Figure 7 is defined as
   follows.

   1.   Whenever MN attaches to n-MAG, the n-MAG requests multicast
        context transfer to p-MAG.

   2.   p-MAG provides the multicast states corresponding to the moving
        MN-Identifier to n-MAG. p-MAG utilizes a context transfer
        protocol to deliver MN's profile to n-MAG, and sends Multicast
        Context Transfer Data (M-CTD) (defined in Section 8.3) to n-MAG.

   3.   n-MAG records MN's profile including multicast channel
        information.

   4.   n-MAG subscribes multicast channel on behalf of MN.  PBU-M is
        transmitted to LMA.  If the received PBA message has the Status
        field value set to 0 (Proxy Binding Update accepted), the MAG
        MUST establish an M-Tunnel for forwarding corresponding
        multicast data if there is no existing M-Tunnel to that LMA.












Asaeda, et al.          Expires September 9, 2010              [Page 17]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


      MN           p-MAG           n-MAG                LMA
       |             |               |                   |
       |-MLD Report->|             MLD Report            |
       |             |============= M-Tunnel ===========>|
       |             |               |                   |---> PIM join
       |             |          Multicast data           |
       |<------------|<============ M-Tunnel ============|
       |             |               |                   |
     Detach          |               |                   |
       |             |               |                   |
     Attach          |               |                   |
       |             |               |                   |
       |------------RS-------------->|                   |
       |             |<---CT-Req-----|                   |
       |             |               |                   |
       |             |-----CXTP----->|                   |
       |             |     M-CTD     |     MLD Report    |
       |             |               |-------PBU-M------>|
       |             |               |                   |
       |             |               |<-------PBA--------|
       |             |               |                   |
       |<-----------RA---------------|                   |
       |             |               |                   |
       |             |               |  Multicast data   |
       |<----------------------------|<==== M-Tunnel ====|
       |             |               |                   |
       |<---------MLD Query----------|     MLD Report    |
       |----------MLD Report-------->|===== M-Tunnel ===>|
       |             |               |                   |

                 Figure 7: MLD listener handover with CXTP

   After MN attaches to n-MAG, the multicast data will be delivered to
   the MN immediately.  MN's multicast membership state is maintained
   with MLD Query and Report messages exchanged by MN and n-MAG.

   Mobile node's multicast state is kept in MN's profile.  If MN's
   policy profile is stored in a policy store [2], it is not necessary
   to use a context transfer protocol between p-MAG and n-MAG.  In such
   a case, n-MAG obtains MN's multicast state by the same mechanism used
   to acquire MN-ID and profile during MN's attachment process [2].

   The procedure for MLD listener handover with MN's Policy Profile
   (Figure 8) is shown as follows.







Asaeda, et al.          Expires September 9, 2010              [Page 18]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


   1.   n-MAG obtains the MN-Identifier and learns multicast channel
        information described in Mobile Node's Policy Profile associated
        to this MN-Identifier.

   2.   n-MAG prepares the PBU-M that includes multicast channel
        information the MN has subscribed.

   3.   n-MAG transmits PBU-M to LMA.  If the received PBA message has
        the Status field value set to 0 (Proxy Binding Update accepted),
        the MAG MUST establish an M-Tunnel for forwarding corresponding
        multicast data if there is no existing M-Tunnel to that LMA.

   4.   LMA forwards requested multicast data through an M-Tunnel
        between the LMA and n-MAG.


      MN           p-MAG           n-MAG                LMA
       |             |               |                   |
       |-MLD Report->|             MLD Report            |
       |             |============= M-Tunnel ===========>|
       |             |               |                   |---> PIM join
       |             |          Multicast data           |
       |<------------|<============ M-Tunnel ============|
       |             |               |                   |
     Detach          |               |                   |
       |             |               |                   |
     Attach          |        MN attachment event        |
       |             |    (Acquire MN-Id and Profile)    |
       |             |               |                   |
       |------------RS-------------->|                   |
       |             |               |     MLD Report    |
       |             |               |-------PBU-M------>|
       |             |               |                   |
       |             |               |<-------PBA--------|
       |             |               |                   |
       |<-----------RA---------------|                   |
       |             |               |                   |
       |             |               |  Multicast data   |
       |<----------------------------|<==== M-Tunnel ====|
       |             |               |                   |
       |<---------MLD Query----------|     MLD Report    |
       |----------MLD Report-------->|===== M-Tunnel ===>|
       |             |               |                   |

         Figure 8: MLD listener handover with MN's Policy Profile






Asaeda, et al.          Expires September 9, 2010              [Page 19]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


8.2.  MAG Operating As Multicast Router

   MAG operating PIM-SM multicast routing protocol joins the multicast
   delivery tree when an attached mobile node subscribes a multicast
   channel.  In order to reduce handover latency, LMA forwards multicast
   data to n-MAG until n-MAG has completed to join the multicast
   delivery tree.  A Proxy Binding Update with multicast extension
   (PBU-M) is always used to request the LMA to forward multicast data.

   When MAG operates PIM-SM routing protocol, leveraging CXTP is the
   possible handover scenario with the following procedure.

   1.   Whenever MN attaches to n-MAG, the n-MAG requests multicast
        context transfer to p-MAG.

   2.   p-MAG provides the multicast states corresponding to the moving
        MN-Identifier to n-MAG. p-MAG utilizes a context transfer
        protocol to deliver MN's profile to n-MAG, and sends M-CTD to
        n-MAG.

   3.   n-MAG initiates the process to subscribe the multicast channels.

   4.   n-MAG requests LMA to forward multicast data in the meantime.
        n-MAG prepares the PBU-M that includes multicast channel
        information the MN has subscribed and has not yet received at
        n-MAG.

   5.   LMA forwards requested multicast data through an M-Tunnel
        between the LMA and n-MAG.

   6.   Whenever n-MAG joins the multicast delivery tree, it notifies
        the LMA to stop forwarding the data and switches to the optimal
        multicast routing path.


















Asaeda, et al.          Expires September 9, 2010              [Page 20]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


     MN            p-MAG           n-MAG                LMA
      |              |               |                   |
      |--MLD Report->|            MLD Hold               |
      |              |=========== M-Tunnel =============>|
      |              |---> PIM join  |                   |---> PIM join
      |              |               |                   |
      |<--Multicast--|               |                   |
      |     data     |               |                   |
    Detach           |               |                   |
      |              |               |                   |
    Attach           |               |                   |
      |              |               |                   |
      |-------------RS-------------->|                   |
      |              |               |                   |
      |              |<---CT-Req-----|                   |
      |              |               |                   |
      |              |-----CXTP----->|                   |
      |              |     M-CTD     |---> PIM join      |
      |              |               |                   |
      |              |               | MLD Report (join) |
      |              |               |-------PBU-M------>|
      |              |               |                   |
      |              |               |<-------PBA--------|
      |              |               |                   |
      |<------------RA---------------|                   |
      |              |               |                   |
      |              |               |  Multicast data   |
      |              |               |<==== M-Tunnel ====|
      |<-------Multicast data--------|                   |
      |              |               |                   |
      |              |      Join process completed       |
      |              |               |                   |
      |              |               |      MLD Hold     |
      |              |               |-------PBU-M------>|
      |              |               |                   |
      |<-------Multicast data--------|                   |
      |              |               |                   |

                    Figure 9: PIM-SM handover with CXTP

   The following procedure is for PIM-SM handover using MN's Policy
   Profile.

   1.   When n-MAG detects a mobile node movement, it obtains the MN-
        Identifier and learns multicast channel information described in
        Mobile Node's Policy Profile associated to this MN-Identifier.





Asaeda, et al.          Expires September 9, 2010              [Page 21]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


   2.   n-MAG prepares the PBU-M that includes multicast channel
        information the MN has subscribed and has not yet received at
        n-MAG.

   3.   n-MAG transmits PBU-M to LMA.  If the received PBA message has
        the Status field value set to 0, the MAG MUST establish an
        M-Tunnel for forwarding corresponding multicast data if there is
        no existing M-Tunnel to that LMA.

   4.   LMA subscribes requested multicast channels and forwards the
        data through an M-Tunnel between the LMA and n-MAG.

   5.   Whenever n-MAG joins the multicast delivery tree, it notifies
        the LMA to stop forwarding the data and switches to the optimal
        multicast routing path.




































Asaeda, et al.          Expires September 9, 2010              [Page 22]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


     MN            p-MAG           n-MAG                LMA
      |              |               |                   |
      |--MLD Report->|               |                   |
      |              |            MLD Hold               |
      |              |=========== M-Tunnel =============>|
      |              |---> PIM join  |                   |---> PIM join
      |              |               |                   |
      |<--Multicast--|               |                   |
      |     data     |               |                   |
      |              |               |                   |
    Detach           |               |                   |
      |              |               |                   |
    Attach           |        MN attachment event        |
      |              |    (Acquire MN-Id and Profile)    |
      |-------------RS-------------->|                   |
      |              |               |---> PIM join      |
      |              |               |                   |
      |              |               | MLD Report (join) |
      |              |               |-------PBU-M------>|
      |              |               |                   |
      |              |               |<-------PBA--------|
      |              |               |                   |
      |<------------RA---------------|                   |
      |              |               |                   |
      |              |               |   Multicast data  |
      |              |               |<==== M-Tunnel ====|
      |<-------Multicast data--------|                   |
      |              |               |                   |
      |              |      Join process completed       |
      |              |               |                   |
      |              |               |      MLD Hold     |
      |              |               |-------PBU-M------>|
      |              |               |                   |
      |<-------Multicast data--------|                   |
      |              |               |                   |

            Figure 10: PIM-SM handover with MN's Policy Profile

8.3.  Multicast Context Transfer Data Format

   The following information is necessary to keep mobile node's
   membership status, and hence M-CTD includes the information.

   1.   Receiver address - indicates an address of a receiver host
        sending the Current-State Report.






Asaeda, et al.          Expires September 9, 2010              [Page 23]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


   2.   Last membership report - indicates the time that the router
        receives the last Current-State Report.

   3.   Filter mode - indicates either INCLUDE or EXCLUDE as defined in
        [4].

   4.   Source addresses and multicast address - indicates the address
        pair that the receiver has joined.

8.4.  Proxy Binding Update with Multicast Extension

     0               1               2               3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
                                     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                                     |            Sequence #         |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |A|H|L|K|M|R|P|C|   Reserved    |            Lifetime           |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                                                               |
     .                                                               .
     .                        Mobility options                       .
     .                                                               .
     |                                                               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

     Figure 11: Proxy Binding Update Message with Multicast Extension

   A Binding Update message that is sent by MAG to LMA is referred to as
   the "Proxy Binding Update" message.  A new flag (C) is included in
   the Binding Update message with multicast extension.  The rest of the
   Binding Update message format remains the same as defined in [10] and
   with the additional (R), (M), and (P) flags, as specified in [12],
   [13], and [2], respectively.

      Multicast Channel Subscription Flag

      A new flag (C) is included in the Binding Update message to
      indicate to LMA that the Binding Update message is a multicast
      channel subscription.

   When (C) flag is specified in PBU-M message, the mobility options
   field includes the same information of MLDv2 Report message [4]:









Asaeda, et al.          Expires September 9, 2010              [Page 24]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |  Type = 143   |    Reserved   |           Checksum            |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |           Reserved            |Nr of Mcast Address Records (M)|
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                                                               |
     .                                                               .
     .                  Multicast Address Record [1]                 .
     .                                                               .
     |                                                               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                                                               |
     .                                                               .
     .                  Multicast Address Record [2]                 .
     .                                                               .
     |                                                               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                               .                               |
     .                               .                               .
     |                               .                               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                                                               |
     .                                                               .
     .                  Multicast Address Record [M]                 .
     .                                                               .
     |                                                               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                                 Figure 12

   Each Multicast Address Record has the following internal format:


















Asaeda, et al.          Expires September 9, 2010              [Page 25]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |  Record Type  |  Aux Data Len |     Number of Sources (N)     |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                                                               |
     *                                                               *
     |                                                               |
     *                       Multicast Address                       *
     |                                                               |
     *                                                               *
     |                                                               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                                                               |
     *                                                               *
     |                                                               |
     *                       Source Address [1]                      *
     |                                                               |
     *                                                               *
     |                                                               |
     +-                                                             -+
     |                                                               |
     *                                                               *
     |                                                               |
     *                       Source Address [2]                      *
     |                                                               |
     *                                                               *
     |                                                               |
     +-                                                             -+
     .                               .                               .
     .                               .                               .
     .                               .                               .
     +-                                                             -+
     |                                                               |
     *                                                               *
     |                                                               |
     *                       Source Address [N]                      *
     |                                                               |
     *                                                               *
     |                                                               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                                                               |
     .                                                               .
     .                         Auxiliary Data                        .
     .                                                               .
     |                                                               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                                 Figure 13




Asaeda, et al.          Expires September 9, 2010              [Page 26]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


   All the above fields contain data with the same definitions in [4].


















































Asaeda, et al.          Expires September 9, 2010              [Page 27]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


9.  IANA Considerations

   This document creates a new registry for the flags in the Binding
   Update message called the "Binding Update Flags".

   The following flags are reserved:

         (A) 0x8000 [RFC3775]

         (H) 0x4000 [RFC3775]

         (L) 0x2000 [RFC3775]

         (K) 0x1000 [RFC3775]

         (M) 0x0800 [RFC4140]

         (R) 0x0400 [RFC3963]

         (P) 0x0200 [RFC5213]

   This document reserves a new flag (C) for "Proxy Binding Update with
   Multicast Extension" as described in Section 8.4 as follows:

         (C) 0x0100

   The rest of the values in the 16-bit field are reserved.  New values
   can be assigned by Standards Action or IESG approval.























Asaeda, et al.          Expires September 9, 2010              [Page 28]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


10.  Security Considerations

   TBD.
















































Asaeda, et al.          Expires September 9, 2010              [Page 29]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


11.  Acknowledgements

   Many of the specifications described in this document are discussed
   and provided by the multimob mailing-list.















































Asaeda, et al.          Expires September 9, 2010              [Page 30]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


12.  References

12.1.  Normative References

   [1]   Bradner, S., "Key words for use in RFCs to indicate requirement
         levels", RFC 2119, March 1997.

   [2]   Gundavelli, S, Ed., Leung, K., Devarapalli, V., Chowdhury, K.,
         and B. Patil, "Proxy Mobile IPv6", RFC 5213, August 2008.

   [3]   Fenner, B., Handley, M., Holbrook, H., and I. Kouvelas,
         "Protocol Independent Multicast - Sparse Mode (PIM-SM):
         Protocol Specification (Revised)", RFC 4601, August 2006.

   [4]   Vida, R. and L. Costa, "Multicast Listener Discovery Version 2
         (MLDv2) for IPv6", RFC 3810, June 2004.

   [5]   Liu, H., Cao, W., and H. Asaeda, "Lightweight IGMPv3 and MLDv2
         Protocols",
         draft-ietf-mboned-lightweight-igmpv3-mldv2-05.txt (work in
         progress), May 2009.

   [6]   Deering, S., Fenner, W., and B. Haberman, "Multicast Listener
         Discovery (MLD) for IPv6", RFC 2710, October 1999.

   [7]   Holbrook, H. and B. Cain, "Source-Specific Multicast for IP",
         RFC 4607, August 2006.

   [8]   Fenner, B., He, H., Haberman, B., and H. Sandick, "Internet
         Group Management Protocol (IGMP) / Multicast Listener Discovery
         (MLD)-Based Multicast Forwarding ("IGMP/MLD Proxying")",
         RFC 4605, August 2006.

   [9]   Asaeda, H. and T. Schmidt, "IGMP and MLD Extensions for Mobile
         Hosts and Routers",
         draft-asaeda-multimob-igmp-mld-mobility-extensions-03.txt (work
         in progress), July 2009.

   [10]  Johnson, D., Perkins, C., and J. Arkko, "Mobility Support in
         IPv6", RFC 3775, June 2004.

   [11]  Loughney, Ed., J., Nakhjiri, M., Perkins, C., and R. Koodli,
         "Context Transfer Protocol (CXTP)", RFC 4067, July 2005.

12.2.  Informative References

   [12]  Devarapalli, V., Wakikawa, R., Petrescu, A., and P. Thubert,
         "Network Mobility (NEMO) Basic Support Protocol", RFC 3963,



Asaeda, et al.          Expires September 9, 2010              [Page 31]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


         January 2005.

   [13]  Soliman, H., Castelluccia, C., El Malki, K., and L. Bellier,
         "Hierarchical Mobile IPv6 Mobility Management (HMIPv6)",
         RFC 4140, August 2005.














































Asaeda, et al.          Expires September 9, 2010              [Page 32]

Internet-Draft       PMIPv6 Extensions for Multicast          March 2010


Authors' Addresses

   Hitoshi Asaeda
   Keio University
   Graduate School of Media and Governance
   5322 Endo
   Fujisawa, Kanagawa  252-8520
   Japan

   Email: asaeda@wide.ad.jp
   URI:   http://www.sfc.wide.ad.jp/~asaeda/


   Pierrick Seite
   France Telecom
   4, rue du Clos Courtel
   BP 91226, Cesson-Sevigne  35512
   France

   Email: pierrick.seite@orange-ftgroup.com


   Jinwei Xia
   Huawei Technologies Co., Ltd.
   Huihong Mansion, No.91 Baixia Rd.
   Nanjing, Jiangsu  21001
   China

   Email: xiajinwei@huawei.com






















Asaeda, et al.          Expires September 9, 2010              [Page 33]


